<template>
  <div>
    <div class="charts_box">
      <el-row>
        <el-col :span="12">
          <h4 class="title">当月访问量</h4>
          <ve-scatter :data="chartData1" :settings="chartSettings1"></ve-scatter>
        </el-col>
        <el-col :span="12">
          <h4 class="title">当月访问趋势</h4>
          <ve-line :data="chartData2"></ve-line>
        </el-col>
      </el-row>
    </div>

  </div>

</template>

<script>
export default {
  data: function() {
    return {
      chartSettings1: {
        dataType: {
          访问用户: "KMB",
          年龄: "normal",
          下单用户: "KMB"
        }
      },
      chartData1: {
        columns: ["日期", "访问用户", "下单用户", "年龄"], //横坐标，纵坐标，散点大小
        rows: {
          上海: [
            { 日期: "1/1", 访问用户: 123, 年龄: 3, 下单用户: 1244 },
            { 日期: "1/2", 访问用户: 1223, 年龄: 6, 下单用户: 2344 },
            { 日期: "1/3", 访问用户: 7123, 年龄: 9, 下单用户: 3245 },
            { 日期: "1/4", 访问用户: 4123, 年龄: 12, 下单用户: 4355 },
            { 日期: "1/5", 访问用户: 3123, 年龄: 15, 下单用户: 4564 },
            { 日期: "1/6", 访问用户: 2323, 年龄: 20, 下单用户: 6537 }
          ],
          北京: [
            { 日期: "1/1", 访问用户: 123, 年龄: 3, 下单用户: 1244 },
            { 日期: "1/2", 访问用户: 1273, 年龄: 6, 下单用户: 2344 },
            { 日期: "1/3", 访问用户: 3123, 年龄: 15, 下单用户: 4564 },
            { 日期: "1/4", 访问用户: 2123, 年龄: 9, 下单用户: 3245 },
            { 日期: "1/5", 访问用户: 4103, 年龄: 12, 下单用户: 4355 },
            { 日期: "1/6", 访问用户: 7123, 年龄: 10, 下单用户: 3567 }
          ],
          广州: [
            { 日期: "1/1", 访问用户: 123, 年龄: 3, 下单用户: 1244 },
            { 日期: "1/2", 访问用户: 1223, 年龄: 6, 下单用户: 2344 },
            { 日期: "1/3", 访问用户: 2123, 年龄: 30, 下单用户: 3245 },
            { 日期: "1/5", 访问用户: 4123, 年龄: 12, 下单用户: 4355 },
            { 日期: "1/4", 访问用户: 5123, 年龄: 18, 下单用户: 4564 },
            { 日期: "1/6", 访问用户: 3843, 年龄: 30, 下单用户: 4850 }
          ]
        }
      },
      chartData2: {
        columns: ["日期", "访问用户", "下单用户", "下单率"],
        rows: [
          { 日期: "1/1", 访问用户: 1393, 下单用户: 1093, 下单率: 0.32 },
          { 日期: "1/2", 访问用户: 3530, 下单用户: 3230, 下单率: 0.26 },
          { 日期: "1/3", 访问用户: 2923, 下单用户: 2623, 下单率: 0.76 },
          { 日期: "1/4", 访问用户: 1723, 下单用户: 1423, 下单率: 0.49 },
          { 日期: "1/5", 访问用户: 3792, 下单用户: 3492, 下单率: 0.323 },
          { 日期: "1/6", 访问用户: 4593, 下单用户: 4293, 下单率: 0.78 }
        ]
      }
    };
  }
};
</script>

<style lang="scss" scoped>
.charts_box {
  .el-col {
    padding: 10px 5%;
  }
  .title{
    border-left: 5px solid #c6ce26;
    padding-left: 10px;
  }
}

.data-empty {
  position: absolute;
  left: 0;
  right: 0;
  top: 0;
  bottom: 0;
  display: flex;
  justify-content: center;
  align-items: center;
  background-color: rgba(255, 255, 255, 0.7);
  color: #888;
  font-size: 14px;
}
</style>
